[{"path":"src\\lib\\text\\reading\\billy-summers.md","title":"billy-summers","markdown":"# Billy Summers\r\n\r\n##### by Stephen King\r\n\r\n##### 4/5\r\n\r\n## Why?\r\n\r\n\"The Institute\" was good enough to get me back into a Stephen King sooner than I normally would. I hope it doesn't backfire. \r\n\r\nHis books tend to run out of steam right at the end, so you can't even bail until it's too late usually. \r\n\r\n## 0\r\n\r\nI'm so down with this, it's got enough levels to play on that I can't imagine not being satisfied by at least one of them.\r\n\r\n## 33\r\n\r\nThe pacing is interesting. It should be at climax but I'm only a third in. Are there really enough pieces set up to fall for the rest of the book? I don't think so. And I don't have a clue what the next arc will be, so... I'm delighted.\r\n\r\n## 50\r\n\r\nI'm delighted by the depth of the character, and the effort going into the separate narratives driving this thing. At this point I'm expecting a convergence of the autobio thread and the realtime thread, though I'm still ready to be surprised.\r\n\r\nThe girl he saves from the road is a knife in my gut, the scene too real and visceral. \r\n\r\n## 75\r\n\r\nIt's been a pleasurable journey. Not at all where I was expecting, and I feel like there's better places to go, but there's still time for it to get wild or get worse. We'll see. \r\n\r\n## 86 \r\n\r\nSomeone told me that the SK books are more about the ride and the feelings along the way than the end. They're right. \r\n\r\nWhen I started the layers seemed to offer an incredible amount of options, but in the end (or in the 86%) so far, I've discovered a narrative more in line with reality than I expected. I suppose there's still time to do a switcheroo, but there's no way this'll end up being the crazy book I was expecting from 0-24%. \r\n\r\n## 100\r\n\r\nI don't want to set any expectations for others... but that's one of the best SK endings I've read. Because I tempered my own expecations? Because it really was that good? I dont know. The bar is certainly different. ","url":"billy-summers","html":""},{"path":"src\\lib\\text\\reading\\brave-new-world.md","title":"brave-new-world","markdown":"# Brave New World\r\n\r\n##### by Alduous Huxley\r\n\r\n##### DNF\r\n\r\n## Why\r\n\r\nrecommended to me by a friend. \r\n\r\n## Start\r\n\r\nInteresting scifi premise. I can see why it came my way. A tad dense for my taste. \r\n\r\n## Stopped Reading \r\n\r\nDidn't really like the writing style, found myself too distracted by it. On top of that, the core ideas have been disseminated through a variety of (from my point of view) better sci-fi content since publication.\r\n\r\nI get it. But it ain't for me.","url":"brave-new-world","html":""},{"path":"src\\lib\\text\\reading\\flowers-for-algernon.md","title":"flowers-for-algernon","markdown":"# flowers for algernon\n\n##### 5/5\n\nThis is short and sweet and worth seeking out if you're ever feeling less than eternally grateful that you were able to parse this sentence.","url":"flowers-for-algernon","html":""},{"path":"src\\lib\\text\\reading\\live-not-by-lies.md","title":"live-not-by-lies","markdown":"# Live not by Lies\n\n","url":"live-not-by-lies","html":""},{"path":"src\\lib\\text\\reading\\lolita.md","title":"lolita","markdown":"# Lolita\n\n##### 5/5\n\nHauntingly beautiful. The prose shockingly good.\n\nRecommend to anyone with a stomach.","url":"lolita","html":""},{"path":"src\\lib\\text\\reading\\project-hail-mary.md","title":"project-hail-mary","markdown":"# Hail Mary\r\n\r\n##### by Andy Weir\r\n\r\n##### 3/5\r\n\r\n## Why?\r\n\r\nI enjoyed the Martian, both the novel and the movie. \r\n\r\n## Start\r\n\r\nFun enough premise. Much like the Martian we've got a plucky scientist type doing science dutifully. \r\n\r\n## Mid\r\n\r\nWith all the pieces out I find myself pleased enough with the book as a whole. I could almost stop reading here because I can predict how the rest might go. \r\n\r\nGreat setting, okay characters, but I'm not one for prolonged \"imaginary-tech-porn.\" That's when an author goes into great detail explaining how their imaginary tech works. \r\n\r\nStephenson does this too and can lose me sometimes, however, Neal brings the weird perverted shit to balance it out. It felt like Andy was having a couple stabs at it but it wasn't my cup of tea. \r\n\r\n## End\r\n\r\nSatisfying enough ending. Would recommend to a sci-fi nerd but probably kind of boring for those that don't enjoy at least a little imaginary-gadgeteering. ","url":"project-hail-mary","html":""},{"path":"src\\lib\\text\\reading\\sensation-and-perception.md","title":"sensation-and-perception","markdown":"# Sensation and Perception\r\n\r\n##### E. Bruce Goldstein\r\n\r\n## Why\r\n\r\nI dunno what to expect. Hope it's cool. ","url":"sensation-and-perception","html":""},{"path":"src\\lib\\text\\reading\\the-epic-of-gilgamesh.md","title":"the-epic-of-gilgamesh","markdown":"# The Epic of Gilgamesh\n\n##### 5/5\n\nWhat a ride. It was amazing to encounter the source of so many archetypes. And the story of its recovery from tablets is almost as fantastic as the tale itself. Love it. ","url":"the-epic-of-gilgamesh","html":""}]